In [14]:
import pandas as pd
import numpy as np

In [18]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, np.nan, 22, np.nan, 28],
    'City': ['New York', np.nan, 'Los Angeles', 'Chicago', np.nan]
}

df = pd.DataFrame(data)

In [20]:
# Display the original DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name   Age         City
0    Alice  24.0     New York
1      Bob   NaN          NaN
2  Charlie  22.0  Los Angeles
3    David   NaN      Chicago
4      Eve  28.0          NaN

In [24]:
df.isnull().sum()

Name    0
Age     2
City    2
dtype: int64

In [26]:
df.fillna(method='bfill')

C:\Users\Hepzi\AppData\Local\Temp\ipykernel_1636\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

      Name   Age         City
0    Alice  24.0     New York
1      Bob  22.0  Los Angeles
2  Charlie  22.0  Los Angeles
3    David  28.0      Chicago
4      Eve  28.0          NaN

In [28]:
df.fillna(method='ffill')

C:\Users\Hepzi\AppData\Local\Temp\ipykernel_1636\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

      Name   Age         City
0    Alice  24.0     New York
1      Bob  24.0     New York
2  Charlie  22.0  Los Angeles
3    David  22.0      Chicago
4      Eve  28.0      Chicago

In [30]:
df.dropna()  #null values get deleted

      Name   Age         City
0    Alice  24.0     New York
2  Charlie  22.0  Los Angeles